
{
  "Agricure": "एग्रीक्योर",
  "Your personal farming companion": "आपका व्यक्तिगत खेती साथी",
  "continue": "जारी रखें",
  "add": "जोड़ें",
  "finishSetup": "सेटअप समाप्त करें",
  "Edit": "संपादित करें",
  "Save": "सहेजें",
  "Cancel": "रद्द करें",
  "auth": {
    "phone": "फ़ोन",
    "email": "ईमेल",
    "phoneNumber": "फ़ोन नंबर",
    "sendOtp": "ओटीपी भेजें",
    "sending": "भेज रहा है...",
    "verifyOtp": "सत्यापित करें और आगे बढ़ें",
    "enterOtp": "भेजे गए 6-अंकीय ओटीपी दर्ज करें",
    "resendOtpIn": "{{seconds}}s में ओटीपी फिर से भेजें",
    "resendOtp": "ओटीपी फिर से भेजें",
    "sendLoginLink": "लॉगिन लिंक भेजें",
    "signInSignUp": "साइन इन / साइन अप करें",
    "tagline": "डेटा से निर्णय, बीज से सफलता।",
    "agreement": {
        "prefix": "जारी रखें पर क्लिक करके, आप हमारी",
        "terms": "सेवा की शर्तों",
        "privacy": "गोपनीयता नीति"
    },
    "toast": {
        "invalidPhoneTitle": "अमान्य फ़ोन नंबर",
        "invalidPhoneDescription": "कृपया एक मान्य 10-अंकीय फ़ोन नंबर दर्ज करें।",
        "otpSentTitle": "ओटीपी भेजा गया",
        "otpSentDescription": "{{phone}} पर एक ओटीपी भेजा गया है।",
        "invalidOtpTitle": "अमान्य ओटीपी",
        "invalidOtpLengthDescription": "कृपया एक मान्य 6-अंकीय ओटीपी दर्ज करें।",
        "invalidOtpDescription": "आपके द्वारा दर्ज किया गया ओटीपी गलत है। कृपया पुनः प्रयास करें।",
        "verificationSuccessTitle": "सफलता",
        "verificationSuccessDescription": "फ़ोन नंबर सफलतापूर्वक सत्यापित हो गया।",
        "loginLinkSentTitle": "लॉगिन लिंक भेजा गया",
        "loginLinkSentDescription": "{{email}} पर एक लॉगिन लिंक भेजा गया है।"
    }
  },
  "onboarding": {
    "step": "चरण {{current}} का {{total}}",
    "language": {
      "title": "भाषा प्राथमिकता",
      "description": "ऐप के लिए अपनी पसंदीदा भाषा चुनें।",
      "placeholder": "एक भाषा चुनें"
    },
    "profile": {
      "title": "व्यक्तिगत विवरण",
      "description": "आइए मूल बातों से शुरू करें। हमें अपने बारे में थोड़ा बताएं।",
      "fullName": "पूरा नाम",
      "fullNamePlaceholder": "उदा., रमेश कुमार",
      "dob": "जन्म तिथि",
      "dobPlaceholder": "एक तारीख चुनें",
      "gender": "लिंग (वैकल्पिक)",
      "genderPlaceholder": "लिंग चुनें",
      "genderMale": "पुरुष",
      "genderFemale": "महिला",
      "genderOther": "अन्य",
      "genderPreferNotToSay": "बताना नहीं चाहते"
    },
     "farmDetails": {
        "title": "खेती का विवरण",
        "description": "बेहतर सिफारिशों के लिए हमें अपने खेत के बारे में बताएं।",
        "farmerType": "किसान का प्रकार",
        "farmerTypePlaceholder": "किसान का प्रकार चुनें",
        "landType": "भूमि का प्रकार",
        "landArea": "कुल भूमि क्षेत्र",
        "landAreaPlaceholder": "उदा., 5.5",
        "irrigation": "प्राथमिक सिंचाई स्रोत",
        "irrigationPlaceholder": "सिंचाई स्रोत चुनें",
        "soilType": "प्राथमिक मिट्टी का प्रकार",
        "soilTypePlaceholder": "मिट्टी का प्रकार चुनें"
    },
    "crops": {
      "title": "आपकी फसलें",
      "description": "आप जो मुख्य फसलें उगा रहे हैं, उन्हें चुनें।",
      "descriptionV2": "अनुकूल सलाह के लिए अपनी मुख्य फसलें और उनके मौसम जोड़ें।",
      "cropName": "फसल का नाम",
      "selectCrop": "एक फसल चुनें",
      "sowingSeason": "बुवाई का मौसम",
      "selectSeason": "मौसम चुनें",
      "harvestMonth": "कटाई का महीना",
      "selectMonth": "महीना चुनें",
      "addCrop": "सूची में फसल जोड़ें",
      "yourCropsList": "आपकी फसलें",
      "noCropsAdded": "आपकी जोड़ी गई फसलें यहां दिखाई देंगी।",
      "placeholder": "उदा., गेहूँ",
      "suggestions": "आपके क्षेत्र के लिए सुझाव",
      "selectedCrops": "चयनित फसलें",
      "noCrops": "अभी तक कोई फसल नहीं जोड़ी गई है।"
    },
    "terms": {
      "title": "नियम और शर्तें",
      "description": "जारी रखने के लिए कृपया नियमों की समीक्षा करें और स्वीकार करें।",
      "agree": "मैंने नियम और शर्तों को पढ़, समझ और स्वीकार कर लिया है",
      "agreeDescription": "सहमत होकर, आप वर्णित अनुसार AI निदान और अन्य सेवाओं के लिए डेटा उपयोग के लिए सहमति देते हैं।",
      "content": "एग्रीक्योर में आपका स्वागत है!\n\nये नियम और शर्तें हमारे एप्लिकेशन के उपयोग के लिए नियमों और विनियमों को रेखांकित करती हैं।\n\nइस ऐप तक पहुंच और उपयोग करके, आप इन नियमों और शर्तों को पूरी तरह से स्वीकार करते हैं। यदि आप इस पृष्ठ पर बताए गए सभी नियमों और शर्तों को स्वीकार नहीं करते हैं तो एग्रीक्योर का उपयोग जारी न रखें।\n\n**1. एप्लिकेशन का उपयोग करने का लाइसेंस**\nजब तक अन्यथा न कहा गया हो, एग्रीक्योर और/या इसके लाइसेंसकर्ता एग्रीक्योर पर सभी सामग्री के बौद्धिक संपदा अधिकारों के स्वामी हैं। सभी बौद्धिक संपदा अधिकार सुरक्षित हैं।\n\n**2. डेटा संग्रह और उपयोगकर्ता सहमति**\nइस ऐप का उपयोग करके, आप एग्रीक्योर को आपके द्वारा प्रदान किए गए डेटा को एकत्र करने, संग्रहीत करने और संसाधित करने की स्पष्ट सहमति देते हैं, जिसमें शामिल है, लेकिन इन्हीं तक सीमित नहीं है:\n\na) **व्यक्तिगत और कृषि जानकारी:** आपका फ़ोन नंबर, ईमेल, खेत का भौगोलिक स्थान (GPS निर्देशांक), मिट्टी का प्रकार, और चुनी हुई फसलें।\nb) **कैमरा एक्सेस:** 'रोग स्कैन' सुविधा के लिए, आप ऐप को विश्लेषण के लिए अपनी फसलों की छवियों को कैप्चर करने और अपलोड करने के लिए अपने डिवाइस के कैमरे तक पहुंचने की अनुमति देने के लिए सहमति देते हैं।\nc) **उपयोग डेटा:** हम अपनी सेवाओं को बेहतर बनाने के लिए आप ऐप के साथ कैसे इंटरैक्ट करते हैं, इस पर डेटा एकत्र कर सकते हैं।\n\nयह डेटा आपको व्यक्तिगत कृषि सलाह प्रदान करने के लिए आवश्यक है, जिसमें मौसम का पूर्वानुमान, बाजार मूल्य, मिट्टी के स्वास्थ्य की जानकारी और रोग जोखिम मूल्यांकन शामिल है।\n\n**3. AI-जनित सलाह और अस्वीकरण**\nआप स्वीकार करते हैं और सहमत हैं कि:\n\na) ऐप के भीतर प्रदान की गई सभी सिफारिशें, निदान और सलाह एक आर्टिफिशियल इंटेलिजेंस (AI) मॉडल द्वारा उत्पन्न की जाती हैं।\nb) यह जानकारी केवल मार्गदर्शन और सूचनात्मक उद्देश्यों के लिए है। इसे पेशेवर कृषि सलाह, क्षेत्र सत्यापन, या वैज्ञानिक परीक्षण का विकल्प नहीं माना जाना चाहिए।\nc) एग्रीक्योर AI-जनित सामग्री की सटीकता, विश्वसनीयता, या पूर्णता के संबंध में कोई वारंटी या गारंटी नहीं देता है।\nd) आप अपनी कृषि पद्धतियों से संबंधित सभी निर्णयों, कार्यों और उनके परिणामों के लिए पूरी तरह से जिम्मेदार हैं। एग्रीक्योर और इसकी मूल कंपनी किसी भी फसल की विफलता, वित्तीय हानि, या अन्य क्षतियों के लिए जिम्मेदार नहीं हैं।\n\n**4. गोपनीयता नीति**\nहमारी गोपनीयता नीति, जो इन शर्तों का एक अभिन्न अंग है, विस्तार से बताती है कि हम आपके डेटा को कैसे संभालते हैं। मुख्य प्रतिबद्धताओं में शामिल हैं:\n\na) हम आपकी स्पष्ट सहमति के बिना विपणन उद्देश्यों के लिए तीसरे पक्षों को आपकी व्यक्तिगत रूप से पहचान योग्य जानकारी (PII) नहीं बेचेंगे या किराए पर नहीं देंगे।\nb) अनाम और समेकित डेटा का उपयोग अनुसंधान, सांख्यिकीय विश्लेषण और हमारे AI मॉडल और सेवाओं को बेहतर बनाने के लिए किया जा सकता है।\n\n**5. संचार सहमति**\nअपने संपर्क विवरण प्रदान करके, आप हमारी सेवाओं से संबंधित संचार प्राप्त करने के लिए एग्रीक्योर को सहमति देते हैं। इसमें शामिल हो सकता है:\n\na) इन-ऐप सूचनाएं\nb) व्हाट्सएप संदेश\nc) SMS/पाठ संदेश\nd) महत्वपूर्ण अलर्ट या समर्थन के लिए स्वचालित या मैन्युअल फ़ोन कॉल।\n\nआप ऐप की सेटिंग्स में किसी भी समय अपनी संचार प्राथमिकताएं प्रबंधित कर सकते हैं।\n\n**6. बाज़ार और तृतीय-पक्ष सेवाएँ**\nऐप में उत्पादों या उपकरणों के लिए बाज़ार शामिल हो सकते हैं। एग्रीक्योर एक सुविधाकर्ता के रूप में कार्य करता है। आपके द्वारा किया गया कोई भी लेनदेन सीधे तीसरे पक्ष के विक्रेता के साथ होता है। हम ऐसे लेनदेन के पक्षकार नहीं हैं और तीसरे पक्षों द्वारा दी जाने वाली उत्पादों या सेवाओं की गुणवत्ता, वितरण, या किसी अन्य पहलू के लिए उत्तरदायी नहीं हैं।\n\n**7. दायित्व की सीमा**\nलागू कानून द्वारा अनुमत अधिकतम सीमा तक, किसी भी स्थिति में एग्रीक्योर, इसके मालिक, या कर्मचारी किसी भी प्रत्यक्ष, अप्रत्यक्ष, दंडात्मक, आकस्मिक, विशेष, या परिणामी क्षति या किसी भी क्षति के लिए उत्तरदायी नहीं होंगे, जिसमें शामिल है, बिना किसी सीमा के, उपयोग, डेटा, फसल की उपज, या मुनाफे की हानि के लिए क्षति, जो एप्लिकेशन के उपयोग या प्रदर्शन से या किसी भी तरह से जुड़ी हुई है।\n\n**8. शर्तों में परिवर्तन**\nएग्रीक्योर किसी भी समय इन नियमों और शर्तों को संशोधित करने का अधिकार सुरक्षित रखता है। हम आपको किसी भी महत्वपूर्ण परिवर्तन की सूचना देंगे। ऐसे परिवर्तनों के बाद ऐप का उपयोग जारी रखकर, आप संशोधित शर्तों से बंधे होने के लिए सहमत हैं।\n\nबॉक्स को चेक करके, आप पुष्टि करते हैं कि आपने इन नियमों और शर्तों को पढ़, समझ लिया है और उनसे बंधे होने के लिए सहमत हैं।"
    },
    "notifications": {
      "title": "अधिसूचना प्राथमिकताएं",
      "description": "आप रिमाइंडर और सुझाव कैसे प्राप्त करना चाहेंगे?",
      "app": "इन-ऐप सूचनाएं",
      "whatsapp": "व्हाट्सएप संदेश",
      "sms": "एसएमएस/पाठ संदेश",
      "calls": "स्वचालित फ़ोन कॉल"
    }
  },
  "location": {
    "title": "आपका स्थान",
    "description": "अनुरूप सलाह प्रदान करने के लिए हमें अपना खेत खोजने में मदद करें।",
    "country": "देश",
    "countryPlaceholder": "उदा. भारत",
    "state": "राज्य / प्रांत",
    "statePlaceholder": "उदा. पंजाब",
    "district": "जिला / शहर",
    "districtPlaceholder": "उदा. अमृतसर",
    "village": "गाँव / कस्बा / क्षेत्र",
    "villagePlaceholder": "उदा. अटारी",
    "pincode": "पिन कोड",
    "pincodePlaceholder": "उदा. 143108",
    "gpsCoordinates": "जीपीएस निर्देशांक (वैकल्पिक)",
    "gpsPlaceholder": "स्वतः पता लगाया गया या मैन्युअल प्रविष्टि",
    "detectAriaLabel": "स्थान का पता लगाएं",
    "detectButton": "मेरे वर्तमान स्थान का उपयोग करें",
    "detecting": "पता लगा रहा है...",
    "mapError": "मानचित्र प्रदर्शित नहीं किया जा सकता। इस सुविधा को सक्षम करने के लिए कृपया अपने पर्यावरण चर (NEXT_PUBLIC_MAP_API_KEY) में एक मान्य मानचित्र API कुंजी प्रदान करें।",
    "suggestionsLoading": "सुझाव लोड हो रहे हैं...",
    "suggestionsError": "सुझाव लोड नहीं हो सके। कृपया अपनी फसल मैन्युअल रूप से दर्ज करें।",
    "districtErrorTitle": "अमान्य जिला",
    "districtErrorDescription": "जिला '{{district}}' राज्य '{{state}}' से संबंधित नहीं लगता है। कृपया एक सही चुनें।",
    "toast": {
      "title": "स्थान का पता चला",
      "description": "स्थान इस पर सेट किया गया: {{location}}",
      "errorTitle": "पता लगाने में विफल",
      "errorMessage": "स्थान का पता नहीं चल सका। कृपया अनुमतियाँ सक्षम करें या मैन्युअल रूप से दर्ज करें।",
      "notSupported": "आपके ब्राउज़र द्वारा जियोलोकेशन समर्थित नहीं है।"
    }
  }
}
